app-code/java/spring-boot-ws/ws-server/countries/request-uk.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://csoftz.com/ws/countries/domain">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>United Kingdom</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>
